; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph0 - mode
	infrared3 - mode
	spectrograph4 - mode
	image5 - mode
	image1 - mode
	thermograph2 - mode
	thermograph8 - mode
	thermograph7 - mode
	infrared6 - mode
	GroundStation2 - direction
	Star4 - direction
	GroundStation3 - direction
	Star0 - direction
	Star1 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image5)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph4)
	(supports instrument1 image1)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph4)
	(supports instrument2 image5)
	(supports instrument2 infrared6)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star1)
	(supports instrument4 thermograph7)
	(supports instrument4 spectrograph4)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star0)
	(supports instrument5 image5)
	(supports instrument5 thermograph8)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
)
(:goal (and
	(pointing satellite1 Planet7)
	(have_image Planet5 thermograph7)
	(have_image Planet6 infrared3)
	(have_image Planet6 image5)
	(have_image Planet7 thermograph2)
	(have_image Phenomenon8 image1)
	(have_image Phenomenon8 spectrograph4)
	(have_image Phenomenon8 thermograph0)
	(have_image Phenomenon9 image1)
	(have_image Phenomenon9 infrared3)
	(have_image Star10 spectrograph4)
))

)

; plan
1. (turn_to satellite2 star0 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star0)
   goals met: 1 of 11
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 11
3. (calibrate satellite2 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 1 of 11
4. (turn_to satellite2 planet7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet7)
   goals met: 1 of 11
5. (take_image satellite2 planet7 instrument4 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 2 of 11
6. (turn_to satellite2 planet5 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet5)
   goals met: 2 of 11
7. (turn_to satellite1 groundstation3 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation3)
   goals met: 1 of 11
8. (turn_to satellite0 star1 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star1)
   goals met: 1 of 11
9. (take_image satellite2 planet5 instrument4 thermograph7)
   added: (have_image planet5 thermograph7)
   goals met: 2 of 11
10. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 11
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 11
12. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 2 of 11
13. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 2 of 11
14. (turn_to satellite0 phenomenon8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 11
15. (take_image satellite0 phenomenon8 instrument1 image1)
   added: (have_image phenomenon8 image1)
   goals met: 3 of 11
16. (take_image satellite0 phenomenon8 instrument1 spectrograph4)
   added: (have_image phenomenon8 spectrograph4)
   goals met: 4 of 11
17. (turn_to satellite0 phenomenon9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 11
18. (take_image satellite0 phenomenon9 instrument1 image1)
   added: (have_image phenomenon9 image1)
   goals met: 5 of 11
19. (take_image satellite0 phenomenon9 instrument1 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 6 of 11
20. (turn_to satellite0 planet6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet6)
   goals met: 6 of 11
21. (take_image satellite0 planet6 instrument1 infrared3)
   added: (have_image planet6 infrared3)
   goals met: 7 of 11
22. (turn_to satellite0 star10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star10)
   goals met: 7 of 11
23. (take_image satellite0 star10 instrument1 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 8 of 11
24. (turn_to satellite1 phenomenon8 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon8)
   goals met: 8 of 11
25. (take_image satellite1 phenomenon8 instrument2 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 9 of 11
26. (turn_to satellite1 planet6 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet6)
   goals met: 9 of 11
27. (take_image satellite1 planet6 instrument2 image5)
   added: (have_image planet6 image5)
   goals met: 10 of 11
28. (turn_to satellite1 planet7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet7)
   goals met: 11 of 11
